In [1]:
import pandas as pd
import os

In [3]:
df = pd.read_excel(r'C:\Users\wangs\Google Drive\4th batch bone mets 4.5 N statistical analysis and plotting\4.5 N hif.xlsx')

In [4]:
df.head()

  Unnamed: 0  Neg  Pos
0      417LT   42    0
1      417LT   22    0
2      417LT   33    0
3      417LT   36    1
4      417LT   28    6

In [5]:
df["Total"] = df['Neg'] + df['Pos']
df.head()

  Unnamed: 0  Neg  Pos  Total
0      417LT   42    0     42
1      417LT   22    0     22
2      417LT   33    0     33
3      417LT   36    1     37
4      417LT   28    6     34

In [6]:
df['Positive Rate'] = df['Pos'] / df['Total']

In [7]:
df.head()

  Unnamed: 0  Neg  Pos  Total  Positive Rate
0      417LT   42    0     42       0.000000
1      417LT   22    0     22       0.000000
2      417LT   33    0     33       0.000000
3      417LT   36    1     37       0.027027
4      417LT   28    6     34       0.176471

In [14]:
df.groupby('Unnamed: 0').mean()

                  Neg       Pos      Total  Positive Rate
Unnamed: 0
417LT       31.000000  1.500000  32.500000       0.043706
418LT       30.285714  5.000000  35.285714       0.143055
419LT       36.111111  5.333333  41.444444       0.129964
447LT       25.100000  5.400000  30.500000       0.177393
447RT       34.833333  3.333333  38.166667       0.079083
451LT       44.900000  4.100000  49.000000       0.082877
451RT       22.200000  5.800000  28.000000       0.215157

In [15]:
df2 = df.groupby('Unnamed: 0').sum()

In [16]:
df2.columns

Index(['Neg', 'Pos', 'Total', 'Positive Rate'], dtype='object')

In [17]:
df.columns

Index(['Unnamed: 0', 'Neg', 'Pos', 'Total', 'Positive Rate'], dtype='object')

In [18]:
df2.head()

            Neg  Pos  Total  Positive Rate
Unnamed: 0
417LT       310   15    325       0.437061
418LT       424   70    494       2.002776
419LT       325   48    373       1.169674
447LT       251   54    305       1.773928
447RT       209   20    229       0.474497

In [19]:
df2['Positive Rate'] = df2['Pos'] / df2['Total']

In [20]:
df2

            Neg  Pos  Total  Positive Rate
Unnamed: 0
417LT       310   15    325       0.046154
418LT       424   70    494       0.141700
419LT       325   48    373       0.128686
447LT       251   54    305       0.177049
447RT       209   20    229       0.087336
451LT       449   41    490       0.083673
451RT       111   29    140       0.207143

In [21]:
df2.to_csv(r'C:\Users\wangs\Google Drive\4th batch bone mets 4.5 N statistical analysis and plotting\4.5N HIF stats.csv')